ohyunsik-cmd/BMS/BMS_extra_file/sluc701/MSP430_I2C/main_MSP430FR2355_I2C.c
// ********************************* End of BQ769x2 Power Commands   *****************************************


// ********************************* BQ769x2 Status and Fault Commands   *****************************************

uint16_t BQ769x2_ReadAlarmStatus() {
    // Read this register to find out why the ALERT pin was asserted
    DirectCommands(AlarmStatus, 0x00, R);
    return (RX_data[1]*256 + RX_data[0]);
}

void BQ769x2_ReadSafetyStatus() { //good example functions
    // Read Safety Status A/B/C and find which bits are set
    // This shows which primary protections have been triggered
    DirectCommands(SafetyStatusA, 0x00, R);
    value_SafetyStatusA = (RX_data[1]*256 + RX_data[0]);
    //Example Fault Flags
    UV_Fault = ((0x4 & RX_data[0])>>2);
    OV_Fault = ((0x8 & RX_data[0])>>3);
    SCD_Fault = ((0x8 & RX_data[1])>>3);
    OCD_Fault = ((0x2 & RX_data[1])>>1);
    DirectCommands(SafetyStatusB, 0x00, R);
    value_SafetyStatusB = (RX_data[1]*256 + RX_data[0]);
    DirectCommands(SafetyStatusC, 0x00, R);
    value_SafetyStatusC = (RX_data[1]*256 + RX_data[0]);
    if ((value_SafetyStatusA + value_SafetyStatusB + value_SafetyStatusC) > 1) {
        ProtectionsTriggered = 1; }
    else {
        ProtectionsTriggered = 0; }
}

void BQ769x2_ReadPFStatus() {
    // Read Permanent Fail Status A/B/C and find which bits are set
    // This shows which permanent failures have been triggered
    DirectCommands(PFStatusA, 0x00, R);
    value_PFStatusA = (RX_data[1]*256 + RX_data[0]);
    DirectCommands(PFStatusB, 0x00, R);
    value_PFStatusB = (RX_data[1]*256 + RX_data[0]);
    DirectCommands(PFStatusC, 0x00, R);
    value_PFStatusC = (RX_data[1]*256 + RX_data[0]);
}

// ********************************* End of BQ769x2 Status and Fault Commands   *****************************************


// ********************************* BQ769x2 Measurement Commands   *****************************************


uint16_t BQ769x2_ReadVoltage(uint8_t command)
// This function can be used to read a specific cell voltage or stack / pack / LD voltage
{
    //RX_data is global var
    DirectCommands(command, 0x00, R);
    if(command >= Cell1Voltage && command <= Cell16Voltage) {//Cells 1 through 16 (0x14 to 0x32)
        return (RX_data[1]*256 + RX_data[0]); //voltage is reported in mV
    }
    else {//stack, Pack, LD
        return 10 * (RX_data[1]*256 + RX_data[0]); //voltage is reported in 0.01V units
    }

}
void BQ769x2_ReadAllVoltages()
// Reads all cell voltages, Stack voltage, PACK pin voltage, and LD pin voltage
{
  unsigned char x;
  int cellvoltageholder = Cell1Voltage; //Cell1Voltage is 0x14
  for (x = 0; x < 16; x++){//Reads all cell voltages
    CellVoltage[x] = BQ769x2_ReadVoltage(cellvoltageholder);
    cellvoltageholder = cellvoltageholder + 2;
  }
  Stack_Voltage = BQ769x2_ReadVoltage(StackVoltage);
  Pack_Voltage = BQ769x2_ReadVoltage(PACKPinVoltage);
  LD_Voltage = BQ769x2_ReadVoltage(LDPinVoltage);
}

uint16_t BQ769x2_ReadCurrent()
// Reads PACK current
{
    DirectCommands(CC2Current, 0x00, R);
    return (RX_data[1]*256 + RX_data[0]);  // current is reported in mA
}

float BQ769x2_ReadTemperature(uint8_t command)
{
    DirectCommands(command, 0x00, R);
    //RX_data is a global var
    return (0.1 * (float)(RX_data[1]*256 + RX_data[0])) - 273.15;  // converts from 0.1K to Celcius
}

void BQ769x2_ReadPassQ(){ // Read Accumulated Charge and Time from DASTATUS6
    Subcommands(DASTATUS6, 0x00, R);
    AccumulatedCharge_Int = ((RX_32Byte[3]<<24) + (RX_32Byte[2]<<16) + (RX_32Byte[1]<<8) + RX_32Byte[0]); //Bytes 0-3
    AccumulatedCharge_Frac = ((RX_32Byte[7]<<24) + (RX_32Byte[6]<<16) + (RX_32Byte[5]<<8) + RX_32Byte[4]); //Bytes 4-7
    AccumulatedCharge_Time = ((RX_32Byte[11]<<24) + (RX_32Byte[10]<<16) + (RX_32Byte[9]<<8) + RX_32Byte[8]); //Bytes 8-11
}


//******************************************************************************
// main ************************************************************************
//******************************************************************************
int main(void)
{
    // Stop watchdog timer
    WDTCTL = WDTPW | WDTHOLD;

    // Initialize GPIOs, clocks and peripherals
    GPIO_initPins();
    UCS_initModule();
    I2C_initModule();

    CommandSubcommands(BQ769x2_RESET);  // Resets the BQ769x2 registers
    delayUS(60000);
    BQ769x2_Init();  // Configure all of the BQ769x2 register settings
    delayUS(10000);
    CommandSubcommands(FET_ENABLE); // Enable the CHG and DSG FETs
    delayUS(10000);
    CommandSubcommands(SLEEP_DISABLE); // Sleep mode is enabled by default. For this example, Sleep is disabled to
                                       // demonstrate full-speed measurements in Normal mode.

    delayUS(60000); delayUS(60000); delayUS(60000); delayUS(60000);  //wait to start measurements after FETs close


  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

    //Reads Cell, Stack, Pack, LD Voltages, Pack Current and TS1/TS3 Temperatures in a loop
    //This basic example polls the Alarm Status register to see if protections have triggered or new measurements are ready
    //The ALERT pin can also be used as an interrupt to the microcontroller for fastest response time instead of polling
    //In this example the LED on the microcontroller board will be turned on to indicate a protection has triggered and will
    //be turned off if the protection condition has cleared.

        AlarmBits = BQ769x2_ReadAlarmStatus();
        if (AlarmBits & 0x80) {  // Check if FULLSCAN is complete. If set, new measurements are available
            BQ769x2_ReadAllVoltages();
            Pack_Current = BQ769x2_ReadCurrent();
            Temperature[0] = BQ769x2_ReadTemperature(TS1Temperature);
            Temperature[1] = BQ769x2_ReadTemperature(TS3Temperature);
            DirectCommands(AlarmStatus, 0x0080, W);  // Clear the FULLSCAN bit
        }

        if (AlarmBits & 0xC000) {  // If Safety Status bits are showing in AlarmStatus register
            BQ769x2_ReadSafetyStatus(); // Read the Safety Status registers to find which protections have triggered
            if (ProtectionsTriggered & 1) {
                P1OUT |= BIT0;             } // Turn on the LED to indicate Protection has triggered
                DirectCommands(AlarmStatus, 0xF800, W); // Clear the Safety Status Alarm bits.
            }
        else
        {
            if (ProtectionsTriggered & 1) {
                BQ769x2_ReadSafetyStatus();
                if (!(ProtectionsTriggered & 1))
                {
                    P1OUT &= ~BIT0;
                }
            } // Turn off the LED if Safety Status has cleared which means the protection condition is no longer present
        }
        delayUS(20000);  // repeat loop every 20 ms
  }
}


void GPIO_initPins()
{
    // Initialize all pins to output low, except P4.5
    P1OUT = 0x00; P2OUT = 0x00;
    P3OUT = 0x00; P4OUT = 0x00;
    P5OUT = 0x00; P6OUT = 0x00;

    P1DIR = 0xFF; P2DIR = 0xFF;
    P3DIR = 0xFF; P4DIR = 0xFF;
    P5DIR = 0xFF; P6DIR = 0xFF;

    // Configure GPIOs
    GPIO_configPins();

    // Disable the GPIO power-on default high-impedance mode to activate
    // previously configured port settings
    PM5CTL0 &= ~LOCKLPM5;
}

void GPIO_configPins()
{
    /* Inputs */

